[
  {
    "id": "5a8b57f25542995d1e6f1371",
    "context": "[]\n\n-----Entities-----\nid|entity|description|number of relationships\n5|SCOTT DERRICKSON|Scott Derrickson is an American director and screenwriter known for films like 'Sinister' and 'Doctor Strange'.|3\n0|ED WOOD|Edward Davis Wood Jr. was an American filmmaker, actor, writer, producer, and director known for his cult films and unique style.|7\n8|SINISTER|Sinister is a 2012 supernatural horror film directed by Scott Derrickson, featuring a true-crime writer.|1\n4|MARTIN LANDAU|Martin Landau was an American actor who played Bela Lugosi in the film 'Ed Wood'.|1\n1|TIM BURTON|Tim Burton is an American film director, producer, and writer renowned for films like 'Ed Wood'.|3\n\n-----Relationships-----\nid|source|target|description|weight|rank|links\n1|ED WOOD|TIM BURTON|Tim Burton directed and produced the film 'Ed Wood', focusing on the life of the filmmaker.|9.0|10|1\n12|SCOTT DERRICKSON|SINISTER|Scott Derrickson directed the film 'Sinister'.|7.0|4|1\n13|SCOTT DERRICKSON|DOCTOR STRANGE|Scott Derrickson directed 'Doctor Strange'.|8.0|4|1\n11|BELA LUGOSI|MARTIN LANDAU|Martin Landau played Bela Lugosi in the film 'Ed Wood'.|8.0|2|1\n\n-----Sources-----\nid|text\n0|Ed Wood (film). Ed Wood is a 1994 American biographical period comedy-drama film directed and produced by Tim Burton, and starring Johnny Depp as cult filmmaker Ed Wood. The film concerns the period in Wood's life when he made his best-known films as well as his relationship with actor Bela Lugosi, played by Martin Landau. Scott Derrickson is an American director, screenwriter and producer. He is best known for directing horror films such as 'Sinister', 'The Exorcism of Emily Rose', and 'Deliver Us From Evil', as well as the 2016 Marvel Cinematic Universe installment, 'Doctor Strange.' Woodson, Arkansas. Woodson is a census-designated place in Pulaski County, Arkansas, named for Ed Wood Sr.\n\n-----Text source that may be relevant-----\nid|text\nchunk_1|Ed Wood is a 1994 American biographical film directed by Tim Burton. Scott Derrickson (born July 16, 1966) is an American director best known for 'Sinister' and 'Doctor Strange.' Woodson, Arkansas is named for Ed Wood Sr.\nchunk_2|Sinister is a 2012 supernatural horror film directed by Scott Derrickson.\nchunk_3|Doctor Strange is a 2016 American superhero film directed by Scott Derrickson.\n"
  }
]